export const UNIT_CALLSIGNS = [
    "Алмаз", "Аркан", "Багира", "Барс", "Беркут",
    "Вепрь", "Викинг", "Волк", "Ворон", "Вымпел",
    "Гепард", "Град", "Гриф", "Гром", "Дозор",
    "Дракон", "Ермак", "Жнец", "Зубр", "Ирбис",
    "Казбек", "Кайман", "Кедр", "Комар", "Коршун",
    "Кречет", "Крот", "Крыс", "Кулон", "Куман",
    "Лесник", "Лис", "Лотос", "Лунь", "Марал",
    "Метеор", "Молот", "Морж", "Орёл", "Острог",
    "Парсек", "Перун", "Пилот", "Питон", "Плутон",
    "Поларис", "Посейдон", "Призма", "Протон", "Пума",
    "Радар", "Развед", "Ратник", "Резон", "Рейдер",
    "Риф", "Росич", "Рубеж", "Рубин", "Рысь",
    "Сапсан", "Сармат", "Сектор", "Селигер", "Скат",
    "Скорп", "Слав", "Следопыт", "Сокол", "Спектр",
    "Статус", "Створ", "Стелс", "Стриж", "Тайфун",
    "Тайга", "Талисман", "Таран", "Титан", "Топаз",
    "Трезуб", "Туман", "Тунгус", "Ураган", "Факел",
    "Фарватер", "Феникс", "Флагман", "Фобос", "Форпост",
    "Фрегат", "Хабар", "Харизма", "Хитин", "Холод",
    "Центр", "Циклон", "Часовой", "Чекин", "Челендж",
    "Черномор", "Черт", "Чиж", "Чук", "Шаман",
    "Шекспир", "Шершень", "Шквал", "Шторм", "Штиль",
    "Щит", "Эверест", "Экскалибур", "Эксперт", "Эридан",
    "Эталон", "Юпитер", "Юркий", "Ягуар", "Якорь",
    "Янтарь", "Ярослав", "Ястреб"
];

export function generateUnitName(): string {
    const randomCallsign = UNIT_CALLSIGNS[Math.floor(Math.random() * UNIT_CALLSIGNS.length)];
    const randomNumber = Math.floor(Math.random() * 100) + 1;
    return `${randomCallsign}-${randomNumber}`;
}
